using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CUIClient.Handler
{
    /// <summary>
    /// EPSPの地域を表すクラスです。
    /// </summary>
    public class Area
    {
        /// <summary>地域コード</summary>
        public string AreaCode { get; private set; }
        /// <summary>地域名</summary>
        public string Name { get; private set; }
        /// <summary>都道府県名</summary>
        public string Prefecture { get; private set; }
        /// <summary>地方名</summary>
        public string Region { get; private set; }

        public Area(string areaCode, string region, string prefecture, string name)
        {
            AreaCode = areaCode;
            Name = name;
            Prefecture = prefecture;
            Region = region;
        }
    }

    /// <summary>
    /// EPSPの地域コードを地域(<see cref="Area"/>)に変換するクラスです。
    /// </summary>
    class AreaConverter
    {
        private static IDictionary<string, Area> areaDictionary = new Dictionary<string, Area>()
        {
            { "900", new Area("900", "未設定", "", "地域未設定") },
            { "901", new Area("901", "不明", "", "地域不明") },
            { "905", new Area("905", "外国", "", "日本以外") },
            { "010", new Area("010", "北海道", "北海道", "北海道 石狩") },
            { "015", new Area("015", "北海道", "北海道", "北海道 渡島") },
            { "020", new Area("020", "北海道", "北海道", "北海道 檜山") },
            { "025", new Area("025", "北海道", "北海道", "北海道 後志") },
            { "030", new Area("030", "北海道", "北海道", "北海道 空知") },
            { "035", new Area("035", "北海道", "北海道", "北海道 上川") },
            { "040", new Area("040", "北海道", "北海道", "北海道 留萌") },
            { "045", new Area("045", "北海道", "北海道", "北海道 宗谷") },
            { "050", new Area("050", "北海道", "北海道", "北海道 網走") },
            { "055", new Area("055", "北海道", "北海道", "北海道 胆振") },
            { "060", new Area("060", "北海道", "北海道", "北海道 日高") },
            { "065", new Area("065", "北海道", "北海道", "北海道 十勝") },
            { "070", new Area("070", "北海道", "北海道", "北海道 釧路") },
            { "075", new Area("075", "北海道", "北海道", "北海道 根室") },
            { "100", new Area("100", "東北", "青森", "青森津軽") },
            { "105", new Area("105", "東北", "青森", "青森三八上北") },
            { "106", new Area("106", "東北", "青森", "青森下北") },
            { "110", new Area("110", "東北", "岩手", "岩手沿岸北部") },
            { "111", new Area("111", "東北", "岩手", "岩手沿岸南部") },
            { "115", new Area("115", "東北", "岩手", "岩手内陸") },
            { "120", new Area("120", "東北", "宮城", "宮城北部") },
            { "125", new Area("125", "東北", "宮城", "宮城南部") },
            { "130", new Area("130", "東北", "秋田", "秋田沿岸") },
            { "135", new Area("135", "東北", "秋田", "秋田内陸") },
            { "140", new Area("140", "東北", "山形", "山形庄内") },
            { "141", new Area("141", "東北", "山形", "山形最上") },
            { "142", new Area("142", "東北", "山形", "山形村山") },
            { "143", new Area("143", "東北", "山形", "山形置賜") },
            { "150", new Area("150", "東北", "福島", "福島中通り") },
            { "151", new Area("151", "東北", "福島", "福島浜通り") },
            { "152", new Area("152", "東北", "福島", "福島会津") },
            { "200", new Area("200", "関東", "茨城", "茨城北部") },
            { "205", new Area("205", "関東", "茨城", "茨城南部") },
            { "210", new Area("210", "関東", "栃木", "栃木北部") },
            { "215", new Area("215", "関東", "栃木", "栃木南部") },
            { "220", new Area("220", "関東", "群馬", "群馬北部") },
            { "225", new Area("225", "関東", "群馬", "群馬南部") },
            { "230", new Area("230", "関東", "埼玉", "埼玉北部") },
            { "231", new Area("231", "関東", "埼玉", "埼玉南部") },
            { "232", new Area("232", "関東", "埼玉", "埼玉秩父") },
            { "240", new Area("240", "関東", "千葉", "千葉北東部") },
            { "241", new Area("241", "関東", "千葉", "千葉北西部") },
            { "242", new Area("242", "関東", "千葉", "千葉南部") },
            { "250", new Area("250", "関東", "東京", "東京") },
            { "255", new Area("255", "関東", "東京", "伊豆諸島北部") },
            { "260", new Area("260", "関東", "東京", "伊豆諸島南部") },
            { "265", new Area("265", "関東", "東京", "小笠原") },
            { "270", new Area("270", "関東", "神奈川", "神奈川東部") },
            { "275", new Area("275", "関東", "神奈川", "神奈川西部") },
            { "300", new Area("300", "北陸", "新潟", "新潟上越") },
            { "301", new Area("301", "北陸", "新潟", "新潟中越") },
            { "302", new Area("302", "北陸", "新潟", "新潟下越") },
            { "305", new Area("305", "北陸", "新潟", "新潟佐渡") },
            { "310", new Area("310", "北陸", "富山", "富山東部") },
            { "315", new Area("315", "北陸", "富山", "富山西部") },
            { "320", new Area("320", "北陸", "石川", "石川能登") },
            { "325", new Area("325", "北陸", "石川", "石川加賀") },
            { "330", new Area("330", "北陸", "福井", "福井嶺北") },
            { "335", new Area("335", "北陸", "福井", "福井嶺南") },
            { "340", new Area("340", "甲信", "山梨", "山梨東部") },
            { "345", new Area("345", "甲信", "山梨", "山梨中・西部") },
            { "350", new Area("350", "甲信", "長野", "長野北部") },
            { "351", new Area("351", "甲信", "長野", "長野中部") },
            { "355", new Area("355", "甲信", "長野", "長野南部") },
            { "400", new Area("400", "東海", "岐阜", "岐阜飛騨") },
            { "405", new Area("405", "東海", "岐阜", "岐阜美濃") },
            { "410", new Area("410", "東海", "静岡", "静岡伊豆") },
            { "411", new Area("411", "東海", "静岡", "静岡東部") },
            { "415", new Area("415", "東海", "静岡", "静岡中部") },
            { "416", new Area("416", "東海", "静岡", "静岡西部") },
            { "420", new Area("420", "東海", "愛知", "愛知東部") },
            { "425", new Area("425", "東海", "愛知", "愛知西部") },
            { "430", new Area("430", "東海", "三重", "三重北中部") },
            { "435", new Area("435", "東海", "三重", "三重南部") },
            { "440", new Area("440", "近畿", "滋賀", "滋賀北部") },
            { "445", new Area("445", "近畿", "滋賀", "滋賀南部") },
            { "450", new Area("450", "近畿", "京都", "京都北部") },
            { "455", new Area("455", "近畿", "京都", "京都南部") },
            { "460", new Area("460", "近畿", "大阪", "大阪北部") },
            { "465", new Area("465", "近畿", "大阪", "大阪南部") },
            { "470", new Area("470", "近畿", "兵庫", "兵庫北部") },
            { "475", new Area("475", "近畿", "兵庫", "兵庫南部") },
            { "480", new Area("480", "近畿", "奈良", "奈良") },
            { "490", new Area("490", "近畿", "和歌山", "和歌山北部") },
            { "495", new Area("495", "近畿", "和歌山", "和歌山南部") },
            { "500", new Area("500", "中国", "鳥取", "鳥取東部") },
            { "505", new Area("505", "中国", "鳥取", "鳥取中・西部") },
            { "510", new Area("510", "中国", "島根", "島根東部") },
            { "515", new Area("515", "中国", "島根", "島根西部") },
            { "514", new Area("514", "中国", "島根", "島根隠岐") },
            { "520", new Area("520", "中国", "岡山", "岡山北部") },
            { "525", new Area("525", "中国", "岡山", "岡山南部") },
            { "530", new Area("530", "中国", "広島", "広島北部") },
            { "535", new Area("535", "中国", "広島", "広島南部") },
            { "540", new Area("540", "中国", "山口", "山口北部") },
            { "545", new Area("545", "中国", "山口", "山口中・東部") },
            { "541", new Area("541", "中国", "山口", "山口西部") },
            { "550", new Area("550", "四国", "徳島", "徳島北部") },
            { "555", new Area("555", "四国", "徳島", "徳島南部") },
            { "560", new Area("560", "四国", "香川", "香川") },
            { "570", new Area("570", "四国", "愛媛", "愛媛東予") },
            { "575", new Area("575", "四国", "愛媛", "愛媛中予") },
            { "576", new Area("576", "四国", "愛媛", "愛媛南予") },
            { "580", new Area("580", "四国", "高知", "高知東部") },
            { "581", new Area("581", "四国", "高知", "高知中部") },
            { "582", new Area("582", "四国", "高知", "高知西部") },
            { "600", new Area("600", "九州北", "福岡", "福岡福岡") },
            { "601", new Area("601", "九州北", "福岡", "福岡北九州") },
            { "602", new Area("602", "九州北", "福岡", "福岡筑豊") },
            { "605", new Area("605", "九州北", "福岡", "福岡筑後") },
            { "610", new Area("610", "九州北", "佐賀", "佐賀北部") },
            { "615", new Area("615", "九州北", "佐賀", "佐賀南部") },
            { "620", new Area("620", "九州北", "長崎", "長崎北部") },
            { "625", new Area("625", "九州北", "長崎", "長崎南部") },
            { "630", new Area("630", "九州北", "長崎", "長崎壱岐・対馬") },
            { "635", new Area("635", "九州北", "長崎", "長崎五島") },
            { "640", new Area("640", "九州北", "熊本", "熊本阿蘇") },
            { "641", new Area("641", "九州北", "熊本", "熊本熊本") },
            { "645", new Area("645", "九州北", "熊本", "熊本球磨") },
            { "646", new Area("646", "九州北", "熊本", "熊本天草・芦北") },
            { "650", new Area("650", "九州北", "大分", "大分北部") },
            { "651", new Area("651", "九州北", "大分", "大分中部") },
            { "655", new Area("655", "九州北", "大分", "大分西部") },
            { "656", new Area("656", "九州北", "大分", "大分南部") },
            { "660", new Area("660", "九州南", "宮崎", "宮崎北部平野部") },
            { "661", new Area("661", "九州南", "宮崎", "宮崎北部山沿い") },
            { "665", new Area("665", "九州南", "宮崎", "宮崎南部平野部") },
            { "666", new Area("666", "九州南", "宮崎", "宮崎南部山沿い") },
            { "670", new Area("670", "九州南", "鹿児島", "鹿児島薩摩") },
            { "675", new Area("675", "九州南", "鹿児島", "鹿児島大隅") },
            { "680", new Area("680", "九州南", "鹿児島", "種子島・屋久島") },
            { "685", new Area("685", "九州南", "鹿児島", "鹿児島奄美") },
            { "700", new Area("700", "沖縄", "沖縄", "沖縄本島北部") },
            { "701", new Area("701", "沖縄", "沖縄", "沖縄本島中南部") },
            { "702", new Area("702", "沖縄", "沖縄", "沖縄久米島") },
            { "710", new Area("710", "沖縄", "沖縄", "沖縄大東島") },
            { "706", new Area("706", "沖縄", "沖縄", "沖縄宮古島") },
            { "705", new Area("705", "沖縄", "沖縄", "沖縄八重山") },
        };

        /// <summary>
        /// 地域コードを地域(<see cref="Area"/>)に変換します。存在しない場合はnullを返します。
        /// </summary>
        public static Area GetArea(string areaCode)
        {
            if (!areaDictionary.ContainsKey(areaCode))
            {
                return null;
            }

            return areaDictionary[areaCode];
        }
    }
}
